# Задача 4
# Дано словарь
A = {1: 'entry 1', 2: 'entry 2', 3: 'entry 3', 4: 'entry 4'}

# Создать кортеж занчений для первих трьох єлементов словоря
res = tuple(A.items())[:3]
print(res)
