# Задача 11
# Проверьте, есть ли в двух наборах какие-либо общие элементы.
# Если да, отобразите общие элементы.
set1 = {10, 20, 30, 40, 50}
set2 = {60, 70, 80, 90, 10}
res = set1.intersection(set2)
print(res)
print(set1 & set2)
