# 7.Создайте словарь, в котором ключами будут числа от 1 до 10,
#   а значениями эти же числа, возведенные в куб.
num_dict = {a: a ** 3 for a in range(1, 11)}
print(num_dict)
