# 6.Определите, есть ли в списке повторяющиеся элементы, если да,
#   то вывести на экран это значение;

# list_3 = [2, 3, 2, 3, 2, 3, 4, 3, 2, 4, 1, 5, -2, -2]
list_3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
list_3.sort()
a = list_3[0] - 1
for i in range(1, len(list_3)):
    if list_3[i-1] == list_3[i] and list_3[i] != a:
        a = list_3[i]
        print(f'Элемент {a} повторяется')
if a == list_3[0] - 1:
    print('Нет совпадений')
