# 5.Найти наибольший элемент списка и вывести его на экран;

list_2 = [2, 4, 6, 8, 10, 12, 14, 45, 16, 18, 20, 22, 24, 26, 28, 30]
print('Максимальный элемент list_2 = ', max(list_2))
